In [2]:
import warnings
warnings.filterwarnings("ignore")

import scanpy as sc
import anndata as ad
import seaborn as sns
import numpy as np

adata_filtered = sc.read_10x_h5("/ix1/ylee/Yifan_Zhang/CellRanger_tests/test_CNS_GEX_0516/outs/filtered_feature_bc_matrix.h5")
df_filtered = adata_filtered.to_df()

In [39]:
import pandas as pd
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
 
# Convert the dictionary into DataFrame 
# ,index=["a", "b", "c", "d"]
df = pd.DataFrame(data,index=["a", "b", "c", "d"])
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [13]:
# access columns by keys
df[['Name']]

     Name
0     Jai
1  Princi
2  Gaurav
3    Anuj

In [74]:
# access rows by index
# when index are not specified, loc and iloc are equal
df.loc['a']

Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Name: a, dtype: object

In [31]:
# select subset
df.loc[[0,1],["Name","Age"]]

     Name  Age
0     Jai   27
1  Princi   24

In [32]:
df.iloc[[0,1],[2,3]]

  Address Qualification
0   Delhi           Msc
1  Kanpur            MA

In [52]:
# iterating over rows
for i, j in df[['Name']].iterrows():
    print(j)

Name    Jai
Name: a, dtype: object
Name    Princi
Name: b, dtype: object
Name    Gaurav
Name: c, dtype: object
Name    Anuj
Name: d, dtype: object

In [71]:
df['Name'][i]

'Anuj'

In [36]:
# creating a list of dataframe columns
columns = list(df)

for i in columns:
    # printing the third element of the column
    print (df[i][2])

['Name', 'Age', 'Address', 'Qualification']

In [50]:
dic_a = {1:[], 2:[22], 3:[3]}
dic_a[1].append(1)
dic_a

{1: [1], 2: [22], 3: [3]}

In [19]:
import pandas as pd
df = pd.DataFrame({
    'col1': [2, 1, 0, 0, 7, 4],
     'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
'col4': [0, 2, 5, 8, 9, 3]})
df

   col1  col2  col3  col4
0     2     2     0     0
1     1     1     1     2
2     0     9     9     5
3     0     8     4     8
4     7     7     2     9
5     4     4     3     3

In [20]:
df.loc['sum'] = df.sum(axis = 0)
# df_filtered.sort_values(by = df_filtered.iloc[-1], axis = 1, ascending=False)
df

     col1  col2  col3  col4
0       2     2     0     0
1       1     1     1     2
2       0     9     9     5
3       0     8     4     8
4       7     7     2     9
5       4     4     3     3
sum    14    31    19    27

In [21]:
df.sort_values(by = ['sum'], axis = 1, ascending=False, inplace=True)
df

     col2  col4  col3  col1
0       2     0     0     2
1       1     2     1     1
2       9     5     9     0
3       8     8     4     0
4       7     9     2     7
5       4     3     3     4
sum    31    27    19    14